
;  ////////////////
;  // Jane Kelly //
;  ////////////////

[WOTC_APA_IntelOfficer X2EncyclopediaTemplate]
ListTitle = "反抗军领袖：情报官"
DescriptionTitle = "反抗军领袖：情报官"
DescriptionEntry = "战地情报官擅长渗透敌占区，暗杀孤立目标。或在激活战斗中，提供监视火力支援和攻势近战推进。"

[WOTC_APA_DirectorKelly X2SoldierClassTemplate]
DisplayName = "反抗军领袖"
ClassSummary = "情报官擅长渗透敌占区，暗杀孤立目标。或在激活战斗中，提供监视火力支援和攻势近战推进。<br/><br/><font color='#CA7200'>可用无托式机枪和剑或战斗刀。</font>"
AbilityTreeTitles[0] = "指挥者"
AbilityTreeTitles[1] = "压阵者"
AbilityTreeTitles[2] = "芬尼亚勇士"
AbilityTreeTitles[3] = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"


; - Ability Templates -

[WOTC_APA_IntelligenceOfficer X2AbilityTemplate]
LocFriendlyName = "情报官"
LocHelpText = "情报官渗透敌占区，提供侦察支援的能力，随着经验而提高。"
LocLongDescription = "情报官渗透敌占区，提供侦察支援的能力，随着经验而提高。"
LocPromotionPopupText = "<font color='#CA7200'>I段</font> (获于<Ability:RANKNAME1/>军衔[1])<br/><Bullet/>获得[天生领袖]能力。<br/><Bullet/>当小队暴露时，保持个人隐蔽。<br/><Bullet/>敌人对你的察觉半径减少<font color='#3ABD23'><Ability:INTEL_OFFICER_DETECTION_MODIFIER_1/>%</font>。<br/><br/><font color='#CA7200'>II段</font>(获于<Ability:RANKNAME3/>军衔[3])<br/><Bullet/>获得[伏击]，可在隐蔽时切换是否进行监视射击的能力。<br/><Bullet/>获得[隐匿]能力，有<font color='#CA7200'><Ability:INTEL_OFFICER_CONCEAL_COOLDOWN/></font>回合冷却。<br/><Bullet/>敌人对你的察觉半径总共减少<font color='#3ABD23'><Ability:INTEL_OFFICER_DETECTION_MODIFIER_2/>%</font>。<br/><br/><font color='#CA7200'>III段</font>(获于<Ability:RANKNAME6/>军衔[6])<br/><Bullet/>获得视野范围的加成<font color='#3ABD23'>+<Ability:INTEL_OFFICER_VISION_TILE_BONUS/></font>格。<br/><Bullet/>敌人对你的察觉半径总共减少<font color='#3ABD23'><Ability:INTEL_OFFICER_DETECTION_MODIFIER_3/>%</font>。<br/><br/>NOTES<br/><Bullet/>重新[隐匿]获得无限次充能，但仍有冷却时间，并要消耗1行动点。它可通过[标准/仅移动]行动点激活。"

[WOTC_APA_Reconceal X2AbilityTemplate]
LocFriendlyName="隐匿·PCP"
LocFlyOverText="隐匿·PCP"
LocHelpText="激活以重新进入隐蔽。消耗1个[标准/仅移动]行动点。有<font color='#CA7200'><Ability:INTEL_OFFICER_CONCEAL_COOLDOWN/></font>-回合冷却。"
LocLongDescription="激活以重新进入隐蔽。消耗1个[标准/仅移动]行动点。有<font color='#CA7200'><Ability:INTEL_OFFICER_CONCEAL_COOLDOWN/></font>-回合冷却。"
LocPromotionPopupText="激活以重新进入隐蔽。消耗1个[标准/仅移动]行动点。有<font color='#CA7200'><Ability:INTEL_OFFICER_CONCEAL_COOLDOWN/></font>-回合冷却。<br/><br/><Bullet/>可在任何位置进入隐蔽状态，但在附近敌人的探测半径内隐蔽时，<Ability:ClassName/>将在侧翼暴露。<br/><Bullet/>隐匿可用[标准/仅移动]行动点激活，并且不会自动结束回合。"